Tekla.Structures.Model.RebarSetExtensions.LayerChangeEnum
An enum defining the possible legface layer actions.

Tekla.Structures.Model.RebarSetExtensions.LayerChangeEnum.BOTTOM
Move the legfaces to be the first layer on their own.

Tekla.Structures.Model.RebarSetExtensions.LayerChangeEnum.DOWN
Move the legfaces up one layer.

Tekla.Structures.Model.RebarSetExtensions.LayerChangeEnum.UP
Move the legfaces down one layer.

Tekla.Structures.Model.RebarSetExtensions.LayerChangeEnum.TOP
Move the legfaces to be the last layer on their own.